#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<pre>terraform
module.thadmin_routing.module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:627002765486:certificate/565d3a00-d047-48f2-956a-aed08dd6956b]
module.thadmin_routing.module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket"]: Refreshing state... [id=E3JOC36ODMBL65]
module.thadmin_hosting.aws_s3_bucket.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.acm.aws_route53_record.validation["thadmin-staging.technicie.nl"]: Refreshing state... [id=Z3I4ZHBBD5NSHU__f4c1968cf0da5157d0f46ed63ecf426e.thadmin-staging.technicie.nl._CNAME]
module.thadmin_routing.module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2022-03-15 04:55:50.004 +0000 UTC]
module.thadmin_hosting.aws_s3_bucket_acl.this: Refreshing state... [id=thalia-thadmin-staging,private]
module.thadmin_hosting.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2ZP8HCBLISQFN]
module.thadmin_routing.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.aws_route53_record.api: Refreshing state... [id=Z3I4ZHBBD5NSHU_thadmin-staging_A]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2732-2048.jpg"]: Refreshing state... [id=apple-splash-2732-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-192x192.png"]: Refreshing state... [id=android-chrome-192x192.png]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-512x512.png"]: Refreshing state... [id=android-chrome-512x512.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2208.jpg"]: Refreshing state... [id=apple-splash-1242-2208.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1125-2436.jpg"]: Refreshing state... [id=apple-splash-1125-2436.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1170-2532.jpg"]: Refreshing state... [id=apple-splash-1170-2532.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.cb9b1cb1.js"]: Refreshing state... [id=js/app.cb9b1cb1.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2224-1668.jpg"]: Refreshing state... [id=apple-splash-2224-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2532-1170.jpg"]: Refreshing state... [id=apple-splash-2532-1170.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["img/anonymousUser.c7a94bce.jpg"]: Refreshing state... [id=img/anonymousUser.c7a94bce.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x310.png"]: Refreshing state... [id=mstile-310x310.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-1536.jpg"]: Refreshing state... [id=apple-splash-2048-1536.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1620-2160.jpg"]: Refreshing state... [id=apple-splash-1620-2160.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x150.png"]: Refreshing state... [id=mstile-310x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["safari-pinned-tab.svg"]: Refreshing state... [id=safari-pinned-tab.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1792-828.jpg"]: Refreshing state... [id=apple-splash-1792-828.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["index.html"]: Refreshing state... [id=index.html]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2778-1284.jpg"]: Refreshing state... [id=apple-splash-2778-1284.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-828-1792.jpg"]: Refreshing state... [id=apple-splash-828-1792.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-144x144.png"]: Refreshing state... [id=mstile-144x144.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2688.jpg"]: Refreshing state... [id=apple-splash-1242-2688.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-750-1334.jpg"]: Refreshing state... [id=apple-splash-750-1334.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2224.jpg"]: Refreshing state... [id=apple-splash-1668-2224.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"]: Refreshing state... [id=img/backgroundImage.24f22a44.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.24f5eb77.js"]: Refreshing state... [id=js/chunk-vendors.24f5eb77.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2160-1620.jpg"]: Refreshing state... [id=apple-splash-2160-1620.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2688-1242.jpg"]: Refreshing state... [id=apple-splash-2688-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1536-2048.jpg"]: Refreshing state... [id=apple-splash-1536-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.24f5eb77.js.map"]: Refreshing state... [id=js/chunk-vendors.24f5eb77.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-touch-icon.png"]: Refreshing state... [id=apple-touch-icon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2388.jpg"]: Refreshing state... [id=apple-splash-1668-2388.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.svg"]: Refreshing state... [id=favicon.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["css/app.5b725460.css"]: Refreshing state... [id=css/app.5b725460.css]
module.thadmin_hosting.aws_s3_object.code_build_object["site.webmanifest"]: Refreshing state... [id=site.webmanifest]
module.thadmin_hosting.aws_s3_object.code_build_object["css/chunk-vendors.de32ab32.css"]: Refreshing state... [id=css/chunk-vendors.de32ab32.css]
module.thadmin_hosting.aws_s3_object.code_build_object["js/525.62f7cb9e.js.map"]: Refreshing state... [id=js/525.62f7cb9e.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1334-750.jpg"]: Refreshing state... [id=apple-splash-1334-750.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1136-640.jpg"]: Refreshing state... [id=apple-splash-1136-640.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-2732.jpg"]: Refreshing state... [id=apple-splash-2048-2732.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-640-1136.jpg"]: Refreshing state... [id=apple-splash-640-1136.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.png"]: Refreshing state... [id=favicon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2436-1125.jpg"]: Refreshing state... [id=apple-splash-2436-1125.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["browserconfig.xml"]: Refreshing state... [id=browserconfig.xml]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.cb9b1cb1.js.map"]: Refreshing state... [id=js/app.cb9b1cb1.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2388-1668.jpg"]: Refreshing state... [id=apple-splash-2388-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/525.62f7cb9e.js"]: Refreshing state... [id=js/525.62f7cb9e.js]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-150x150.png"]: Refreshing state... [id=mstile-150x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-70x70.png"]: Refreshing state... [id=mstile-70x70.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2208-1242.jpg"]: Refreshing state... [id=apple-splash-2208-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1284-2778.jpg"]: Refreshing state... [id=apple-splash-1284-2778.jpg]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-192x192.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "android-chrome-192x192.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-512x512.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "android-chrome-512x512.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1125-2436.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1125-2436.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1136-640.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1136-640.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1170-2532.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1170-2532.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2208.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1242-2208.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2688.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1242-2688.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1284-2778.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1284-2778.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1334-750.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1334-750.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1536-2048.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1536-2048.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1620-2160.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1620-2160.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2224.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1668-2224.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2388.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1668-2388.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1792-828.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-1792-828.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-1536.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2048-1536.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-2732.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2048-2732.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2160-1620.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2160-1620.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2208-1242.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2208-1242.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2224-1668.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2224-1668.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2388-1668.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2388-1668.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2436-1125.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2436-1125.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2532-1170.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2532-1170.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2688-1242.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2688-1242.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2732-2048.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2732-2048.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2778-1284.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-2778-1284.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-640-1136.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-640-1136.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-750-1334.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-750-1334.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-828-1792.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-splash-828-1792.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["apple-touch-icon.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "apple-touch-icon.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["browserconfig.xml"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "browserconfig.xml"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["css/app.5b725460.css"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
        id                     = "css/app.5b725460.css"
        tags                   = {}
        # (11 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["css/chunk-vendors.de32ab32.css"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "css/chunk-vendors.de32ab32.css"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["favicon-16x16.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "favicon-16x16.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["favicon-32x32.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "favicon-32x32.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["favicon.ico"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "favicon.ico"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["favicon.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "favicon.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["favicon.svg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "favicon.svg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["img/anonymousUser.c7a94bce.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "img/anonymousUser.c7a94bce.jpg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      ~ etag                   = "407e69540c950ce3e893be2cbadd0f30-2" -> "5f59aad8b5eddf226c7e5a21939e4018"
        id                     = "img/backgroundImage.24f22a44.jpg"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      ~ etag                   = "15d75771a35793ddcbb1ab8d87d70d66" -> "9660736e13654699fdaf659d3c6c6121"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/333.1b2ab5a8.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "4dedc6ec5e486fe388a3e3a0c8958984"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/333.1b2ab5a8.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/333.1b2ab5a8.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/333.1b2ab5a8.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "afd3726080ed71e432606da33ce9add6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/333.1b2ab5a8.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/333.1b2ab5a8.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525.62f7cb9e.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "a43826e483d16e3d773e141f6833304b" -> null
      - force_destroy          = false -> null
      - id                     = "js/525.62f7cb9e.js" -> null
      - key                    = "js/525.62f7cb9e.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525.62f7cb9e.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525.62f7cb9e.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "64416b6a76d7fb059fe2f5b59791b279" -> null
      - force_destroy          = false -> null
      - id                     = "js/525.62f7cb9e.js.map" -> null
      - key                    = "js/525.62f7cb9e.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525.62f7cb9e.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.6b573aef.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "42e6f8730eb30501b6498a8305fa7988"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.6b573aef.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.6b573aef.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.6b573aef.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "515bcb4474cb70101e0a4701f28b10b2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.6b573aef.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.6b573aef.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.cb9b1cb1.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "52cd028ace5e00a2f71b2c11373c57d6" -> null
      - force_destroy          = false -> null
      - id                     = "js/app.cb9b1cb1.js" -> null
      - key                    = "js/app.cb9b1cb1.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.cb9b1cb1.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.cb9b1cb1.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "7a82e1d40ed36bf42753e98f4d79fc40" -> null
      - force_destroy          = false -> null
      - id                     = "js/app.cb9b1cb1.js.map" -> null
      - key                    = "js/app.cb9b1cb1.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.cb9b1cb1.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.24f5eb77.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "3b86dcb6feeffe763a27e61020999df8" -> null
      - force_destroy          = false -> null
      - id                     = "js/chunk-vendors.24f5eb77.js" -> null
      - key                    = "js/chunk-vendors.24f5eb77.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.24f5eb77.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.24f5eb77.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                    = "private" -> null
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "4e590e9958d6ef66df1da3a6cd1a18d3" -> null
      - force_destroy          = false -> null
      - id                     = "js/chunk-vendors.24f5eb77.js.map" -> null
      - key                    = "js/chunk-vendors.24f5eb77.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.24f5eb77.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.8baecbbb.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "455f8ca25989f5523b89a2bc4cccf66f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.8baecbbb.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.8baecbbb.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.8baecbbb.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "1e288d98ed758ac8f1f3816b3b64a0a9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.8baecbbb.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.8baecbbb.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["mstile-144x144.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "mstile-144x144.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["mstile-150x150.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "mstile-150x150.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x150.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "mstile-310x150.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x310.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "mstile-310x310.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["mstile-70x70.png"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "mstile-70x70.png"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["safari-pinned-tab.svg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "safari-pinned-tab.svg"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["site.webmanifest"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
        id                 = "site.webmanifest"
        tags               = {}
        # (10 unchanged attributes hidden)
    }

Plan: 6 to add, 47 to change, 6 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_profile" but a value
was found in file "terraform.tfvars". To use this value, add a "variable"
block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

</pre>
</details>